function [J, grad] = costFunction(theta, X, y)
%COSTFUNCTION Вычисляет значения функции стоимости и ее градиента для
%   логистической регрессии.

% Инициализация полезных переменных
m = length(y); % количество обучающих примеров

% Вы должны вернуть корректные значения следующих переменных
J = 0;
grad = zeros(size(theta));

% ====================== НАЧАЛО ВАШЕГО КОДА ======================
% Замечание: grad должен иметь те же размерности, что и theta







% ====================== КОНЕЦ ВАШЕГО КОДА ======================

end
